jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/main/service/impl/AtsStorageServiceImpl.cpp
#include "stm32f1xx_hal.h"
#include "AtsStorageServiceImpl.hpp"
#include "IoServiceImpl.hpp"
#include "DeviceKey.hpp"
#include "SystemClock.hpp"
// MainView.hpp removed — ECG decoupled via EcgSampleCallback
#include "ats/ArcanaTsSchema.hpp"
#include "ats/ArcanaTsTypes.hpp"
#include "ff.h"
#include "diskio.h"
#include <cstring>
#include <cstdio>
#include "DisplayStatus.hpp"
#include "SdBenchmarkServiceImpl.hpp"
#include "Log.hpp"
#include "EventCodes.hpp"
#include "SerialAppender.hpp"
#include "AtsAppender.hpp"
#include "DeviceAppender.hpp"
#include "SyslogAppender.hpp"

// Synthetic ECG waveform LUT (one heartbeat, 250 samples @ 250Hz = 1 sec = 60 BPM)
// Values 0-99: 0=top of ECG area, 70=baseline, 99=bottom. Like Lead II.
static const uint8_t ECG_LUT[] = {
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,69,68,66,64,63,63,64,66, 68,69,70,70,70,70,70,70,70,70, // P wave (small)
    70,70,70,70,70,70,70,70,72,75, 70,50,25, 5, 0, 5,25,50,80,90, // Q-R-S (sharp!)
    85,78,72,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // ST segment
    70,69,67,64,61,58,56,55,55,56, 58,61,64,67,69,70,70,70,70,70, // T wave (rounded)
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70,
};
static const uint16_t ECG_LUT_LEN = sizeof(ECG_LUT);


extern "C" {
    extern volatile uint8_t g_exfat_ready;
    void sdio_force_reinit(void);
    void sd_card_full_reinit(void);
    void ats_safe_eject(void);
    FRESULT texfat_format(void);
}

// Called from MQTT task when "eject" command received
void ats_safe_eject(void) {
    arcana::atsstorage::AtsStorageServiceImpl& svc =
        static_cast<arcana::atsstorage::AtsStorageServiceImpl&>(
            arcana::atsstorage::AtsStorageServiceImpl::getInstance());
    svc.stop();
}

namespace arcana {
namespace sdbench { extern FATFS sFatFs; }

// Defined in Controller.cpp
// g_mainView removed — use mEcgCallback instead
namespace atsstorage {


// Static storage
uint8_t AtsStorageServiceImpl::sKey[crypto::ChaCha20::KEY_SIZE] = {};
uint8_t AtsStorageServiceImpl::sSlowBuf[ats::BLOCK_SIZE] = {};
uint8_t AtsStorageServiceImpl::sReadCache[ats::BLOCK_SIZE] = {};
uint8_t AtsStorageServiceImpl::sDevSlowBuf[ats::BLOCK_SIZE] = {};
FIL AtsStorageServiceImpl::sSharedFil = {};

// Time source for ArcanaTS — uses SystemClock epoch or tick fallback
static uint32_t atsGetTime() {
    if (SystemClock::getInstance().isSynced()) {
        return SystemClock::getInstance().now();
    }
    return (uint32_t)xTaskGetTickCount();
}


// Logger platform helpers (function pointers for LogConfig)
static void logEnterCritical()  { taskENTER_CRITICAL(); }
static void logExitCritical()   { taskEXIT_CRITICAL(); }
static uint32_t logEnterCriticalISR() { return portSET_INTERRUPT_MASK_FROM_ISR(); }
static void logExitCriticalISR(uint32_t mask) { portCLEAR_INTERRUPT_MASK_FROM_ISR(mask); }
static uint32_t logGetTick() { return (uint32_t)xTaskGetTickCount(); }

AtsStorageServiceImpl::AtsStorageServiceImpl()
    : mDb()
    , mFilePort()
    , mMutex()
    , mCipher()
    , mTaskBuffer()
    , mTaskStack{}
    , mTaskHandle(0)
    , mRunning(false)
    , mDbReady(false)
    , mDeviceDbReady(false)
    , mFormatRequested(false)
    , mUploadPause(false)
    , mUploadRequested(false)
    , mPendingData()
    , mWriteSemBuffer()
    , mWriteSem(0)
    , mStatsObs("AtsStorage Stats")
    , mStatsModel()
    , mTotalRecords(0)
    , mWindowStartTick(0)
    , mWritesInWindow(0)
    , mLastRate(0)
    , mBaselineBlocksFailed(0)
{
    input.SensorData = 0;
    output.StatsEvents = &mStatsObs;
}

AtsStorageServiceImpl::~AtsStorageServiceImpl() {
    stop();
}

AtsStorageService& AtsStorageServiceImpl::getInstance() {
    static AtsStorageServiceImpl sInstance;
    return sInstance;
}

ServiceStatus AtsStorageServiceImpl::initHAL() {
    crypto::DeviceKey::deriveKey(sKey);
    return ServiceStatus::OK;
}

ServiceStatus AtsStorageServiceImpl::init() {
    mWriteSem = xSemaphoreCreateBinaryStatic(&mWriteSemBuffer);
    if (!mWriteSem) return ServiceStatus::Error;

    mMutex.init();

    return ServiceStatus::OK;
}

ServiceStatus AtsStorageServiceImpl::start() {
    mRunning = true;
    mTaskHandle = xTaskCreateStatic(
        storageTask, "AtsStore", TASK_STACK_SIZE,
        this, tskIDLE_PRIORITY + 1, mTaskStack, &mTaskBuffer);
    if (!mTaskHandle) return ServiceStatus::Error;

    if (input.SensorData) {
        input.SensorData->subscribe(onSensorData, this);
    }
    return ServiceStatus::OK;
}


void AtsStorageServiceImpl::stop() {
    mRunning = false;
    if (mTaskHandle) {
        xSemaphoreGive(mWriteSem);
        vTaskDelay(pdMS_TO_TICKS(200));  // Wait for storageTask to do cleanup
        mTaskHandle = 0;
    }
}

void AtsStorageServiceImpl::onSensorData(SensorDataModel* model, void* context) {
    AtsStorageServiceImpl* self = static_cast<AtsStorageServiceImpl*>(context);
    self->mPendingData = *model;
    xSemaphoreGive(self->mWriteSem);
}

void AtsStorageServiceImpl::storageTask(void* param) {
    AtsStorageServiceImpl* self = static_cast<AtsStorageServiceImpl*>(param);

    // Initialize Logger with SerialAppender (works before SD is ready)
    static log::SerialAppender sSerialApp;
    static log::AtsAppender    sAtsApp;
    static log::DeviceAppender sDevApp;

    log::LogConfig logCfg;
    memset(&logCfg, 0, sizeof(logCfg));
    logCfg.enterCritical    = logEnterCritical;
    logCfg.exitCritical     = logExitCritical;
    logCfg.enterCriticalISR = logEnterCriticalISR;
    logCfg.exitCriticalISR  = logExitCriticalISR;
    logCfg.getTime          = atsGetTime;
    logCfg.getTick          = logGetTick;
    log::Logger::getInstance().init(logCfg);
    log::Logger::getInstance().addAppender(&sSerialApp);
    log::Logger::getInstance().addAppender(&log::SyslogAppender::getInstance());

    // Wait for exFAT filesystem
    while (!g_exfat_ready && self->mRunning) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    if (!self->mRunning) { vTaskDelete(0); return; }

    // Clean up corrupt files from previous crashes
    f_unlink("sensor_bad.ats");

