jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/main/service/impl/AtsStorageServiceImpl.cpp
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_READY, self->mTotalRecords);
    log::Logger::getInstance().drain(8);

    for (;;) {
        self->taskLoop();

        // --- Close DBs ---
        LOG_I(ats::ErrorSource::Tsdb, evt::ATS_SHUTDOWN);
        sAtsApp.detach();
        if (self->mDbReady) {
            self->mDb.close();
            self->mDbReady = false;
        }
        if (self->mDeviceDbReady) {
            self->writeLifecycleEvent(
                static_cast<uint8_t>(ats::LifecycleEventType::PowerOff), 0);
            self->mDeviceDb.close();
            self->mDeviceDbReady = false;
        }
        sDevApp.detach();
        log::Logger::getInstance().drain(8);
        // n_fats=2 simple mirror: both FATs always identical, no sync needed

        if (!self->mFormatRequested) {
            // --- Safe eject: unmount, wait for card swap, remount ---
            f_mount(0, "", 0);
            LOG_I(ats::ErrorSource::Tsdb, evt::ATS_SAFE_EJECT);
            display::toast("Safe to remove", 0x7FFFFFFF,
                          (uint32_t)xTaskGetTickCount(),
                          display::colors::WHITE, display::colors::GREEN);

            // Wait for KEY2 press to resume (insert card first)
            bool key2Was = false;
            for (;;) {
                vTaskDelay(pdMS_TO_TICKS(100));
                bool pressed = (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13)
                                == GPIO_PIN_RESET);
                if (!pressed) { key2Was = true; continue; }
                if (!key2Was) continue;  // Need release-first
                // KEY2 pressed after being released → remount
                display::toast("Mounting...", 5000, (uint32_t)xTaskGetTickCount(),
                              display::colors::WHITE, 0xFD20);
                LOG_I(ats::ErrorSource::Tsdb, evt::ATS_KEY2_RESUME);
                vTaskDelay(pdMS_TO_TICKS(1000)); // Debounce + card settle
                sd_card_full_reinit();  // Full card re-enumeration after swap
                f_mount(0, "", 0);  // Clear stale mount state
                if (f_mount(&::arcana::sdbench::sFatFs, "", 1) != FR_OK) {
                    display::toast("Mount FAILED!", 3000,
                                  (uint32_t)xTaskGetTickCount(),
                                  display::colors::WHITE, display::colors::RED);
                    LOG_E(ats::ErrorSource::Tsdb, evt::ATS_REMOUNT_FAIL);
                    continue;  // Keep waiting
                }
                break;
            }

            // Reopen DBs
            display::toast("Resumed!", 2000, (uint32_t)xTaskGetTickCount(),
                          display::colors::WHITE, display::colors::GREEN);
            sdio_force_reinit();
            if (self->openDeviceDb()) {
                sDevApp.attach(&self->mDeviceDb);
                self->writeLifecycleEvent(
                    static_cast<uint8_t>(ats::LifecycleEventType::PowerOn), 0);
            }
            if (self->openDailyDb()) {
                sAtsApp.attach(&self->mDb, 1);
            }
            self->mRunning = true;
            LOG_I(ats::ErrorSource::Tsdb, evt::ATS_READY, self->mTotalRecords);
            log::Logger::getInstance().drain(8);
            continue;  // Back to taskLoop
        }

        // --- Runtime format + restart ---
        self->mFormatRequested = false;
        display::toast("Formatting...", 10000, (uint32_t)xTaskGetTickCount(),
                      display::colors::WHITE, 0xFD20);
        f_mount(0, "", 0);

        FRESULT fr = texfat_format();
        if (fr != FR_OK) {
            display::toast("Format FAILED!", 3000,
                          (uint32_t)xTaskGetTickCount(),
                          display::colors::WHITE, display::colors::RED);
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_FORMAT_FAIL, (uint32_t)fr);
            vTaskDelay(pdMS_TO_TICKS(3000));
            // Retry: reinit SD + try format again next loop
            sdio_force_reinit();
            self->mFormatRequested = true;
            continue;
        }

        // Remount (reuse SdBenchmark's FATFS)
        if (f_mount(&::arcana::sdbench::sFatFs, "", 1) != FR_OK) {
            display::toast("Mount FAILED!", 3000,
                          (uint32_t)xTaskGetTickCount(),
                          display::colors::WHITE, display::colors::RED);
            vTaskDelay(pdMS_TO_TICKS(3000));
            sdio_force_reinit();
            self->mFormatRequested = true;
            continue;
        }
        display::toast("Format OK!", 2000, (uint32_t)xTaskGetTickCount(),
                      display::colors::WHITE, display::colors::GREEN);
        LOG_I(ats::ErrorSource::Tsdb, evt::ATS_FORMAT_OK);

        // Re-publish SD capacity to ViewModel
        static_cast<sdbench::SdBenchmarkServiceImpl&>(
            sdbench::SdBenchmarkServiceImpl::getInstance()).refreshSdInfo();

        vTaskDelay(pdMS_TO_TICKS(1000));

        // Reopen DBs
        if (self->openDeviceDb()) {
            sDevApp.attach(&self->mDeviceDb);
            self->writeLifecycleEvent(
                static_cast<uint8_t>(ats::LifecycleEventType::PowerOn), 0);
        }
        if (self->openDailyDb()) {
            sAtsApp.attach(&self->mDb, 1);
        }

        self->mTotalRecords = 0;
        self->mBaselineBlocksFailed = 0;
        self->mRunning = true;
        LOG_I(ats::ErrorSource::Tsdb, evt::ATS_READY, 0);
        log::Logger::getInstance().drain(8);
        // Loop back to taskLoop
    }

    vTaskDelete(0);
}

bool AtsStorageServiceImpl::openDailyDb() {
    ats::AtsConfig cfg;
    memset(&cfg, 0, sizeof(cfg));

    cfg.file = &mFilePort;
    cfg.cipher = &mCipher;
    cfg.mutex = &mMutex;
    cfg.getTime = atsGetTime;
    cfg.key = sKey;
    cfg.headerKey = crypto::DeviceKey::getFleetKey();
    cfg.deviceUid = (const uint8_t*)UID_BASE;
    cfg.deviceUidSize = 12;
    cfg.overflow = ats::OverflowPolicy::Drop;
    cfg.primaryChannel = 0xFF;  // no primary — all channels use slowBuf
    cfg.primaryBufA = 0;
    cfg.primaryBufB = 0;
    cfg.slowBuf = sSlowBuf;
    cfg.readCache = sReadCache;

    if (!mDb.open("sensor.ats", cfg)) {
        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
        f_unlink("sensor.ats");
        if (!mDb.open("sensor.ats", cfg)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
            return false;
        }
    }
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_SENSOR_DB_INFO,
          mDb.getStats().totalRecords);

    // If recovery loaded channels, skip addChannel/start
    if (!mDb.isReadOnly() && mDb.getChannelCount() == 0) {
        ats::ArcanaTsSchema sensor = ats::ArcanaTsSchema::mpu6050();
        if (!mDb.addChannel(0, sensor)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_CHANNEL_FAIL, 0);
            mDb.close();
            return false;
        }

