jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/main/service/impl/AtsStorageServiceImpl.cpp
        ats::ArcanaTsSchema errLog = ats::ArcanaTsSchema::errorLog();
        if (!mDb.addChannel(1, errLog)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_CHANNEL_FAIL, 1);
            mDb.close();
            return false;
        }

        if (!mDb.start()) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_START_FAIL);
            mDb.close();
            return false;
        }
    }

    // OTA upgrade: add missing channels to existing sensor.ats
    upgradeSensorChannels();

    mDbReady = true;
    mTotalRecords = mDb.getStats().totalRecords;
    mBaselineBlocksFailed = mDb.getStats().blocksFailed;
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_OK, mTotalRecords);
    return true;
}

void AtsStorageServiceImpl::rotateDailyDb(uint32_t lastDay) {
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_ROTATE_OK, lastDay);

    // Close current DB (flushes, writes index, syncs)
    mDb.close();
    mDbReady = false;

    // Rename sensor.ats to YYYYMMDD.ats
    char oldName[] = "sensor.ats";
    char newName[16];
    snprintf(newName, sizeof(newName), "%08lu.ats", (unsigned long)lastDay);
    f_rename(oldName, newName);

    // Open fresh DB
    if (!openDailyDb()) {
        LOG_E(ats::ErrorSource::Tsdb, evt::ATS_ROTATE_FAIL, lastDay);
    }
}

// ---------------------------------------------------------------------------
// device.ats — permanent lifecycle DB
// ---------------------------------------------------------------------------

bool AtsStorageServiceImpl::initDeviceDbChannels() {
    ats::ArcanaTsSchema lc = ats::ArcanaTsSchema::lifecycleEvent();
    if (!mDeviceDb.addChannel(0, lc)) return false;
    ats::ArcanaTsSchema cfgSchema = ats::ArcanaTsSchema::config();
    mDeviceDb.addChannel(1, cfgSchema);
    ats::ArcanaTsSchema creds = ats::ArcanaTsSchema::credentials();
    mDeviceDb.addChannel(2, creds);
    return mDeviceDb.start();
}

bool AtsStorageServiceImpl::openDeviceDbSafe(const ats::AtsConfig& cfg) {
    // Attempt 1: open existing
    if (mDeviceDb.open("device.ats", cfg)) {
        // Live upgrade: add missing channels (OTA)
        if (mDeviceDb.getChannelCount() > 0 && mDeviceDb.getChannelCount() < 3) {
            ats::ArcanaTsSchema creds = ats::ArcanaTsSchema::credentials();
            if (mDeviceDb.addChannelLive(2, creds)) {
                LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DEVICE_UPGRADE);
            }
        }
        return true;
    }

    // Attempt 2: existing file corrupt → preserve + recreate
    LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DEVICE_CORRUPT);
    f_unlink("device_old.ats");
    f_rename("device.ats", "device_old.ats");
    if (mDeviceDb.open("device.ats", cfg)) {
        if (initDeviceDbChannels()) return true;
        mDeviceDb.close();
    }

    // Attempt 3: give up
    return false;
}

bool AtsStorageServiceImpl::openDeviceDb() {
    ats::AtsConfig cfg;
    memset(&cfg, 0, sizeof(cfg));

    cfg.file = &mDeviceFilePort;
    cfg.cipher = &mCipher;
    cfg.mutex = &mMutex;  // shared with sensor DB (same task)
    cfg.getTime = atsGetTime;
    cfg.key = sKey;
    cfg.headerKey = crypto::DeviceKey::getFleetKey();
    cfg.deviceUid = (const uint8_t*)UID_BASE;
    cfg.deviceUidSize = 12;
    cfg.overflow = ats::OverflowPolicy::Drop;
    cfg.primaryChannel = 0xFF;
    cfg.slowBuf = sDevSlowBuf;
    cfg.readCache = sReadCache;

    f_unlink("device.ats.bak");  // clean up old migration artifact

    if (!openDeviceDbSafe(cfg)) {
        LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DEVICE_UNAVAIL);
        return true;  // never block boot
    }

    // New device.ats (just created, no channels yet) → init all channels
    if (mDeviceDb.getChannelCount() == 0) {
        if (!initDeviceDbChannels()) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DEVICE_CH_FAIL);
            return true;  // degraded
        }
    }

    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DEVICE_DB_INFO,
          mDeviceDb.getStats().totalRecords);

    // Write test
    {
        uint8_t testRec[12] = {};
        uint32_t ts = atsGetTime();
        memcpy(testRec, &ts, 4);
        testRec[4] = 0xFF;
        mDeviceDb.append(0, testRec);
        uint32_t blkBefore = mDeviceDb.getStats().blocksWritten;
        mDeviceDb.flush();
        if (mDeviceDb.getStats().blocksWritten <= blkBefore) {
            LOG_W(ats::ErrorSource::Sdio, evt::SDIO_REINIT);
            sdio_force_reinit();
            mDeviceDb.append(0, testRec);
            mDeviceDb.flush();
        }
    }

    mDeviceDbReady = true;
    return true;
}

void AtsStorageServiceImpl::restoreTimeFromDeviceDb() {
    if (!mDeviceDbReady) return;
    if (SystemClock::getInstance().isSynced()) return;  // RTC already valid

    // Read latest lifecycle record to get last known timestamp
    // LIFECYCLE record: [ts:4][eventType:1][eventCode:2][reserved:1][param:4] = 12 bytes
    uint8_t buf[12];
    uint16_t n = mDeviceDb.queryLatest(0, buf, 1);
    if (n > 0) {
        uint32_t lastEpoch;
        memcpy(&lastEpoch, buf, 4);
        if (lastEpoch > 1577836800) {  // > 2020-01-01
            SystemClock::getInstance().sync(lastEpoch);
            LOG_I(ats::ErrorSource::System, evt::SYS_BOOT_RTC_RESTORE, lastEpoch);
        }
    }
}

void AtsStorageServiceImpl::writeLifecycleEvent(uint8_t eventType, uint32_t param) {
    if (!mDeviceDbReady) return;

    // LIFECYCLE schema: ts(U32), evtTyp(U8), evtCod(U16), rsv(U8), param(U32) = 12 bytes
    uint8_t rec[12];
    uint32_t ts = atsGetTime();
    memcpy(rec, &ts, 4);
    rec[4] = eventType;
    rec[5] = 0; rec[6] = 0;  // eventCode = 0
    rec[7] = 0;               // reserved
    memcpy(rec + 8, &param, 4);

    mDeviceDb.append(0, rec);
    mDeviceDb.flush();  // lifecycle events must persist immediately

    // Map LifecycleEventType → event code for Logger
    uint16_t logCode = evt::ATS_LIFECYCLE_ON;
    switch (eventType) {
        case 0x01: logCode = evt::ATS_LIFECYCLE_ON;    break;
        case 0x02: logCode = evt::ATS_LIFECYCLE_OFF;   break;
        case 0x03: logCode = evt::ATS_LIFECYCLE_RECOV; break;
        case 0x10: logCode = evt::ATS_LIFECYCLE_FWUPD; break;
        default:   logCode = evt::ATS_LIFECYCLE_ON;    break;
    }
    LOG_W(ats::ErrorSource::Tsdb, logCode, param);
}

void AtsStorageServiceImpl::writeRecoveryEvents(
        uint32_t recoveredRec, uint16_t truncations, uint16_t skippedBlocks) {
    // 1. device.ats — LIFECYCLE Recovery event
    //    evtTyp=Recovery, evtCod=truncations, param=recoveredRec
    if (mDeviceDbReady) {
        uint8_t rec[12];
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        rec[4] = static_cast<uint8_t>(ats::LifecycleEventType::Recovery);
        uint16_t code = truncations;
        memcpy(rec + 5, &code, 2);
        rec[7] = (uint8_t)skippedBlocks;
        memcpy(rec + 8, &recoveredRec, 4);
        mDeviceDb.append(0, rec);
        mDeviceDb.flush();
        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_RECOVERY_OK, recoveredRec);
    }

    // 2. sensor.ats — ERROR_LOG ch1 (if channel exists)
    //    sev=INFO(1), src=ATS(0x10), errCod=truncations, param=recoveredRec
    if (mDbReady && mDb.getChannelCount() > 1) {
        uint8_t rec[12];
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        rec[4] = 0x01;   // severity: INFO
        rec[5] = 0x10;   // source: ATS recovery
        uint16_t code = truncations;
        memcpy(rec + 6, &code, 2);
        memcpy(rec + 8, &recoveredRec, 4);
        mDb.append(1, rec);
        // flush happens in taskLoop's first 1-second window
    }
}

// ---------------------------------------------------------------------------
// Upload support: file enumeration + upload tracking
// ---------------------------------------------------------------------------

uint8_t AtsStorageServiceImpl::listPendingUploads(PendingFile* out, uint8_t maxCount) {
    uint8_t count = 0;

    DIR dir;
    FILINFO fno;
    if (f_opendir(&dir, "") != FR_OK) return 0;

    while (f_readdir(&dir, &fno) == FR_OK && fno.fname[0] && count < maxCount) {
        // Match YYYYMMDD.ats (8 digits + ".ats" = 12 chars)
        const char* name = fno.fname;
        uint16_t len = strlen(name);
        if (len != 12) continue;
        if (name[8] != '.' || name[9] != 'a' || name[10] != 't' || name[11] != 's') continue;

