jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/main/service/impl/AtsStorageServiceImpl.cpp
        // Skip sensor.ats and device.ats
        if (strcmp(name, "sensor.ats") == 0 || strcmp(name, "device.ats") == 0) continue;

        // Parse date
        uint32_t date = 0;
        bool valid = true;
        for (int i = 0; i < 8; i++) {
            if (name[i] < '0' || name[i] > '9') { valid = false; break; }
            date = date * 10 + (name[i] - '0');
        }
        if (!valid || date < 20200101) continue;

        // Check if already uploaded
        if (isDateUploaded(date)) continue;

        // Add to list
        strncpy(out[count].name, name, 15);
        out[count].name[15] = '\0';
        out[count].size = (uint32_t)fno.fsize;
        out[count].date = date;
        count++;
    }
    f_closedir(&dir);
    return count;
}

bool AtsStorageServiceImpl::isDateUploaded(uint32_t dateYYYYMMDD) {
    if (!mDeviceDbReady) return false;

    // Query latest 64 LIFECYCLE records using shared read cache
    // Each LIFECYCLE record = 12 bytes: [ts:4][evtType:1][evtCode:2][rsv:1][param:4]
    static const uint16_t REC_SIZE = 12;
    static const uint16_t SCAN_COUNT = ats::BLOCK_SIZE / REC_SIZE;  // ~341 records fit in 4KB
    uint8_t* buf = sReadCache;  // reuse 4KB read cache (same task, sequential)

    uint16_t n = mDeviceDb.queryLatest(0, buf, SCAN_COUNT);
    for (uint16_t i = 0; i < n; i++) {
        uint8_t* rec = buf + i * REC_SIZE;
        uint8_t evtType = rec[4];
        uint32_t param;
        memcpy(&param, rec + 8, 4);

        if (evtType == static_cast<uint8_t>(ats::LifecycleEventType::UploadDone) &&
            param == dateYYYYMMDD) {
            return true;
        }
    }
    return false;
}

void AtsStorageServiceImpl::markUploaded(uint32_t dateYYYYMMDD) {
    writeLifecycleEvent(
        static_cast<uint8_t>(ats::LifecycleEventType::UploadDone),
        dateYYYYMMDD);
}

// ---------------------------------------------------------------------------

bool AtsStorageServiceImpl::loadTzConfig(int16_t& offsetMin, uint8_t& autoCheck) {
    // Try device.ats ch1 (CONFIG) first
    if (mDeviceDbReady && mDeviceDb.getChannelCount() > 1) {
        // CONFIG record: 19 bytes (matches ats::ArcanaTsSchema::config())
        // Field layout (offsets):
        //   ts U32       0..3
        //   pressTg U16  4..5
        //   flowRt  U16  6..7
        //   tmrSec  U16  8..9
        //   thrHi   I16 10..11
        //   thrLo   I16 12..13
        //   mode    U8  14
        //   flags   U8  15
        //   tzOff   I16 16..17
        //   tzAuto  U8  18
        uint8_t buf[19];
        uint16_t n = mDeviceDb.queryLatest(1, buf, 1);
        if (n > 0) {
            memcpy(&offsetMin, buf + 16, 2);
            autoCheck = buf[18];
            return true;
        }
    }

    // No ch1 CONFIG → first boot or old device.ats, will auto-detect via WiFi
    return false;
}

bool AtsStorageServiceImpl::saveTzConfig(int16_t offsetMin, uint8_t autoCheck) {
    // Write to device.ats ch1 (CONFIG) if available
    if (mDeviceDbReady && mDeviceDb.getChannelCount() > 1) {
        // 19-byte CONFIG record — see loadTzConfig() for field layout.
        uint8_t rec[19];
        memset(rec, 0, sizeof(rec));
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        memcpy(rec + 16, &offsetMin, 2);
        rec[18] = autoCheck;
        mDeviceDb.append(1, rec);
        mDeviceDb.flush();
        return true;
    }

    // No ch1 CONFIG on old device.ats — timezone will be re-detected next boot
    return false;
}

// ---------------------------------------------------------------------------
// Credentials persistence — device.ats ch2 (CREDS)
// Record: [ts:4][data:232] where data = [nonce:12][encrypted_creds:220]
// ---------------------------------------------------------------------------

bool AtsStorageServiceImpl::loadCredentials(uint8_t* outBuf, uint16_t bufSize,
                                             uint16_t& outLen) {
    outLen = 0;
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_LOAD);
    if (!mDeviceDbReady || mDeviceDb.getChannelCount() < 3) return false;

    // CREDS record = 236 bytes (4 ts + 232 data)
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_QUERY);

    uint8_t rec[236];
    uint16_t n = mDeviceDb.queryLatest(2, rec, 1);
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_QUERY2, (uint32_t)n);
    if (n == 0) return false;

    // data starts at offset 4 (after ts)
    uint16_t dataLen = 232;
    if (dataLen > bufSize) dataLen = bufSize;
    memcpy(outBuf, rec + 4, dataLen);
    outLen = dataLen;
    return true;
}

bool AtsStorageServiceImpl::saveCredentials(const uint8_t* data, uint16_t len) {
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_SAVE_START);
    if (!mDeviceDbReady || mDeviceDb.getChannelCount() < 3) return false;
    if (len > 232) return false;

    uint8_t rec[236];
    memset(rec, 0, sizeof(rec));
    uint32_t ts = atsGetTime();
    memcpy(rec, &ts, 4);
    memcpy(rec + 4, data, len);

    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_APPEND);
    bool appOk = mDeviceDb.append(2, rec);
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_APPEND_OK, (uint32_t)appOk);
    mDeviceDb.flush();
    LOG_D(ats::ErrorSource::Tsdb, evt::ATS_CRED_DONE);
    return true;
}

// ---------------------------------------------------------------------------
// Schema upgrade after OTA — add missing channels to existing .ats
// ---------------------------------------------------------------------------

void AtsStorageServiceImpl::upgradeSensorChannels() {
    if (mDb.isReadOnly()) return;
    // Future channels defined here. addChannelLive() is a no-op if already active.
    // Example: if OTA adds USER_ACTION channel to sensor DB:
    // ats::ArcanaTsSchema ua = ats::ArcanaTsSchema::userAction();
    // mDb.addChannelLive(2, ua);
}

// ---------------------------------------------------------------------------

void AtsStorageServiceImpl::taskLoop() {
    uint32_t lastDay = 0;
    uint32_t lastReportTick = xTaskGetTickCount();
    TickType_t nextWake = xTaskGetTickCount();
    uint32_t windowOk = 0;
    uint32_t windowFail = 0;
    uint8_t rec[RECORD_SIZE];
    memset(rec, 0, RECORD_SIZE);
    uint32_t ecgPhase = 0;  // LUT index for synthetic ECG
    uint8_t key1Hold = 0;   // KEY1 hold counter (seconds)
    uint8_t key2Hold = 0;   // KEY2 state (0=released, 1=pressed)
    bool key2Seen = false;  // KEY2 must be seen released (HIGH) before first detect
    uint32_t key2PressStart = 0;  // tick when KEY2 was first pressed
    (void)key1Hold; (void)key2Hold; (void)key2Seen; (void)key2PressStart;

