jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/main/service/impl/AtsStorageServiceImpl.cpp
    bool provisionToastShown = false;

    while (mRunning) {
        // Cooperative pause for upload (yield cleanly after finishing write)
        while (mUploadPause && mRunning) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }

        // 1kHz pacing — 1 record per ms
        vTaskDelayUntil(&nextWake, 1);

        // Drain log events (1 per ms = up to 1000 events/s)
        if (log::Logger::getInstance().pending() > 0) {
            log::Logger::getInstance().drain(1);
        }

        if (!mDbReady) {
            // DB failed (e.g. rotation error) — retry every 5 seconds
            static uint32_t retryTick = 0;
            uint32_t now = xTaskGetTickCount();
            if (now - retryTick >= pdMS_TO_TICKS(5000)) {
                retryTick = now;
                LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DB_RETRY_FAIL);
                sdio_force_reinit();
                if (openDailyDb()) {
                    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DB_RECOVERED);
                } else {
                    LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DB_RETRY_FAIL);
                }
            }
            continue;
        }

        // Synthetic ECG value from LUT
        uint8_t ecgVal = ECG_LUT[ecgPhase % ECG_LUT_LEN];
        ecgPhase++;

        // Push ECG sample via callback (250Hz, thread-safe, decoupled from View)
        if ((mTotalRecords & 3) == 0 && mEcgCallback) {
            mEcgCallback(ecgVal);
        }

        // Build synthetic record (will be replaced by real ADS1298 SPI data)
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        float temp = 25.0f + (float)(mTotalRecords % 1000) * 0.01f;
        memcpy(rec + 4, &temp, 4);
        int16_t ax = (int16_t)(50 - (int16_t)ecgVal) * 400;  // ECG as accelerometer value
        memcpy(rec + 8, &ax, 2);
        memcpy(rec + 10, &ax, 2);
        memcpy(rec + 12, &ax, 2);

        if (mDb.append(0, rec)) {
            mTotalRecords++;
            windowOk++;
        } else {
            windowFail++;
        }

        // Report + LCD update every 1 second
        uint32_t now = xTaskGetTickCount();
        if ((now - lastReportTick) >= pdMS_TO_TICKS(1000)) {
            bool flushed = mDb.flush();
            if (!flushed) {
                sdio_force_reinit();
                flushed = mDb.flush();
                if (!flushed) LOG_E(ats::ErrorSource::Tsdb, evt::ATS_FLUSH_FAIL,
                                    mDb.getStats().blocksFailed);
            }

            mStatsModel.recordCount = mTotalRecords;
            mStatsModel.writesPerSec = (uint16_t)windowOk;
            mStatsModel.totalKB = (mDb.getStats().blocksWritten + 1) * 4;
            mStatsModel.kbPerSec = (uint16_t)(windowOk * RECORD_SIZE / 1024);
            mStatsModel.updateTimestamp();
            mStatsObs.publish(&mStatsModel);

            uint32_t sessionFail = mDb.getStats().blocksFailed - mBaselineBlocksFailed;
            (void)sessionFail;
            LOG_D(ats::ErrorSource::Tsdb, evt::ATS_STATS, (uint32_t)mTotalRecords);

            // Send stats to syslog (picked up by MQTT task)
            log::SyslogAppender::getInstance().sendStats(
                mTotalRecords, (uint16_t)windowOk, mStatsModel.totalKB,
                atsGetTime());

            // One-time warning after LCD is guaranteed ready
            if (!provisionToastShown) {
                provisionToastShown = true;
                if (!crypto::DeviceKey::isProvisioned()) {
                    LOG_W(ats::ErrorSource::Crypto, 0xFF00);  // debug: not provisioned
                    display::toast("NOT PROVISIONED", 5000,
                                   now, display::colors::WHITE, display::colors::RED);
                }
            }

            windowOk = 0;
            windowFail = 0;
            lastReportTick = now;

            // Midnight rotation
            if (SystemClock::getInstance().isSynced()) {
                uint32_t today = SystemClock::dateYYYYMMDD(
                    SystemClock::getInstance().now());
                if (lastDay != 0 && today != lastDay) {
                    rotateDailyDb(lastDay);
                }
                lastDay = today;
            }

            // Size guard removed — IFilePort now uses uint64_t, no 4GB limit

            // KEY1/KEY2 handled by IoServiceImpl (independent task)
            {
                auto& ioSvc = io::IoServiceImpl::getInstance();
                if (ioSvc.isFormatRequested()) {
                    ioSvc.clearFormatRequest();
                    LOG_W(ats::ErrorSource::Tsdb, evt::ATS_KEY1_FORMAT);
                    mRunning = false;
                    mFormatRequested = true;
                }
            }
        }
    }
}

void AtsStorageServiceImpl::appendRecord(const SensorDataModel* model) {
    if (!mDbReady) return;

    uint8_t rec[RECORD_SIZE];
    serializeRecord(model, rec);

    if (mDb.append(0, rec)) {
        mTotalRecords++;
        mWritesInWindow++;

        // Rate tracking (DWT cycle counter, 1-second window)
        static volatile uint32_t* const DWT_CYCCNT = (volatile uint32_t*)0xE0001004;
        uint32_t now = *DWT_CYCCNT;
        if (mWindowStartTick == 0) {
            mWindowStartTick = now;
        }
        uint32_t elapsed = now - mWindowStartTick;
        uint32_t elapsedMs = elapsed / (SystemCoreClock / 1000);
        if (elapsedMs >= 1000) {
            mLastRate = mWritesInWindow;
            LOG_D(ats::ErrorSource::Tsdb, evt::ATS_STATS_BRIEF, (uint32_t)mTotalRecords);
            mWritesInWindow = 0;
            mWindowStartTick = now;
        }

        mStatsModel.recordCount = mTotalRecords;
        mStatsModel.writesPerSec = mLastRate;
        mStatsModel.totalKB = (mDb.getStats().blocksWritten + 1) * 4;
        mStatsModel.kbPerSec = (uint16_t)(mLastRate * RECORD_SIZE / 1024);
        mStatsModel.updateTimestamp();
        mStatsObs.publish(&mStatsModel);
    }
}

void AtsStorageServiceImpl::serializeRecord(const SensorDataModel* model, uint8_t* buf) {
    // ts: U32 (epoch seconds)
    uint32_t ts = atsGetTime();
    memcpy(buf, &ts, 4);

    // temp: F32
    memcpy(buf + 4, &model->temperature, 4);

